# Generador de un csv de ejemplo

In [1]:
from pandas import *
from random import randint, choice

lista_ciudades = ['Bogotá', 'Chía', 'Cajica', 'Zipa', 'Tenjo']
lista_generos = ['M', 'F']

nombres = []
edades = []
generos = []
ciudades = []
hijos = []
mascotas = []
vehiculos = []
salario = []

In [2]:
for i in range(10000):
    nombres.append('persona_'+str(i))
    edades.append(randint(20, 70))
    generos.append(choice(lista_generos))
    ciudades.append(choice(lista_ciudades))
    hijos.append(randint(0, 3))
    mascotas.append(randint(0, 5))
    vehiculos.append(randint(0, 2))
    salario.append(randint(900, 7000))

In [3]:
cv data = {
                       <: salario
}

In [4]:
df = DataFrame(data, columns = ['nombres', 'edades', 'generos',
                                'ciudades', 'hijos', 'mascotas',
                                'vehiculos', 'salario'])

In [5]:
df.head()

     nombres  edades generos ciudades  hijos  mascotas  vehiculos  salario
0  persona_0      52       F     Chía      2         5          1     4169
1  persona_1      54       F     Chía      0         2          0     6815
2  persona_2      63       F   Bogotá      3         2          2     2648
3  persona_3      60       F   Bogotá      0         0          2     4627
4  persona_4      32       M   Bogotá      2         4          2     1227

In [6]:
df.                                                                                                                                      ('info.csv')